# Используем официальный образ Node.js как базовый образ
FROM node:16-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /usr/src/app

# Копируем package.json и package-lock.json в контейнер
COPY package*.json ./

# Устанавливаем зависимости
RUN npm ci

# Копируем все файлы проекта в контейнер
COPY . .

# Опционально, если у вас есть файл .env с конфигурацией, скопируйте его в контейнер
# COPY .env .

ENV PORT=3000

# Определяем порт, на котором будет работать наше приложение
# Если ваш телеграм-бот использует другой порт, укажите его здесь
EXPOSE $PORT

# Запускаем команду для запуска приложения
CMD [ "npm", "start" ]
